
# 每相位对应的采集器ID列表
phase2collector_dict = {8: [2, 3, 14, 15], # 南北左转
                        7: [4, 5, 6, 16, 17, 18], # 南北直行
                        6: [7, 8, 19, 20, 21], # 东西左转
                        5: [9, 10, 11, 12, 22, 23, 24, 25], # 东西直行
                        }
phase2collector_dict2 = {8: [1, 2, 12, 13], # 南北左转
                        7: [3, 4, 5, 14, 15, 16], # 南北直行
                        6: [6, 7, 17, 18, 19], # 东西左转
                        5: [8, 9, 10, 11, 20, 21, 22, 23], # 东西直行
                        }
# 字典结构：车道编号 -> {计数器编号 -> {车道序号、其他参数}}
lane_counter_dict = {
    2: {  # 车道编号 2
        17: {"车道序号": 8,"方向":"东西左转","车道方向":"东西左转第一条车道","位置":"西"},  # 计数器编号 21 的数据
        18: {"车道序号": 7,"方向":"东西左转","车道方向":"东西左转第二条车道","位置":"西"},  # 计数器编号 22 的数据
        19: {"车道序号": 6,"方向":"东西左转","车道方向":"东西左转第三条车道","位置":"西"},  # 计数器编号 21 的数据
        20: {"车道序号": 5,"方向":"东西直行","车道方向":"东西直行第四条车道","位置":"西"},  # 计数器编号 22 的数据
        21: {"车道序号": 4,"方向":"东西直行","车道方向":"东西直行第五条车道","位置":"西"},  # 计数器编号 21 的数据
        22: {"车道序号": 3,"方向":"东西直行","车道方向":"东西直行第六条车道","位置":"西"},  # 计数器编号 22 的数据
        23: {"车道序号": 2,"方向":"东西直行","车道方向":"东西直行第七条车道","位置":"西"},  # 计数器编号 22 的数据
    },
    6: {  # 车道编号 3
        12: {"车道序号": 6,"方向":"南北左转","车道方向":"南北左转第一条车道","位置":"南"},  # 计数器编号 21 的数据
        13: {"车道序号": 5,"方向":"南北左转","车道方向":"南北左转第二条车道","位置":"南"},  # 计数器编号 22 的数据
        14: {"车道序号": 4,"方向":"南北直行","车道方向":"南北直行第三条车道","位置":"南"},  # 计数器编号 21 的数据
        15: {"车道序号": 3,"方向":"南北直行","车道方向":"南北直行第四条车道","位置":"南"},  # 计数器编号 22 的数据
        16: {"车道序号": 2,"方向":"南北直行","车道方向":"南北直行第五条车道","位置":"南"},  # 计数器编号 21 的数据
    },
    11: {  # 车道编号 11
        6: {"车道序号": 7,"方向":"东西左转","车道方向":"东西左转第一条车道","位置":"东"},  # 计数器编号 22 的数据
        7: {"车道序号": 6,"方向":"东西左转","车道方向":"东西左转第二条车道","位置":"东"},  # 计数器编号 21 的数据
        8: {"车道序号": 5,"方向":"东西直行","车道方向":"东西直行第三条车道","位置":"东"},  # 计数器编号 22 的数据
        9: {"车道序号": 4,"方向":"东西直行","车道方向":"东西直行第四条车道","位置":"东"},  # 计数器编号 21 的数据
        10: {"车道序号": 3,"方向":"东西直行","车道方向":"东西直行第五条车道","位置":"东"},  # 计数器编号 22 的数据
        11: {"车道序号": 2,"方向":"东西直行","车道方向":"东西直行第六条车道","位置":"东"},  # 计数器编号 22 的数据
    },
    12: {  # 车道编号 3
        1: {"车道序号": 6,"方向":"南北左转","车道方向":"南北左转第一条车道","位置":"北"},  # 计数器编号 22 的数据
        2: {"车道序号": 5,"方向":"南北左转","车道方向":"南北左转第二条车道","位置":"北"},  # 计数器编号 21 的数据
        3: {"车道序号": 4,"方向":"南北直行","车道方向":"南北直行第三条车道","位置":"北"},  # 计数器编号 22 的数据
        4: {"车道序号": 3,"方向":"南北直行","车道方向":"南北直行第四条车道","位置":"北"},  # 计数器编号 21 的数据
        5: {"车道序号": 2,"方向":"南北直行","车道方向":"南北直行第五条车道","位置":"北"},  # 计数器编号 22 的数据
    }
}

lane_counter_dict = {
    2: {  # 车道编号 2
        17: {"车道序号": 8,"方向":"东西左转","车道方向":"东西左转第一条车道","位置":"西"},  # 计数器编号 21 的数据
        18: {"车道序号": 7,"方向":"东西左转","车道方向":"东西左转第二条车道","位置":"西"},  # 计数器编号 22 的数据
        19: {"车道序号": 6,"方向":"东西左转","车道方向":"东西左转第三条车道","位置":"西"},  # 计数器编号 21 的数据
        20: {"车道序号": 5,"方向":"东西直行","车道方向":"东西直行第四条车道","位置":"西"},  # 计数器编号 22 的数据
        21: {"车道序号": 4,"方向":"东西直行","车道方向":"东西直行第五条车道","位置":"西"},  # 计数器编号 21 的数据
        22: {"车道序号": 3,"方向":"东西直行","车道方向":"东西直行第六条车道","位置":"西"},  # 计数器编号 22 的数据
        23: {"车道序号": 2,"方向":"东西直行","车道方向":"东西直行第七条车道","位置":"西"},  # 计数器编号 22 的数据
    },
    6: {  # 车道编号 3
        12: {"车道序号": 6,"方向":"南北左转","车道方向":"南北左转第一条车道","位置":"南"},  # 计数器编号 21 的数据
        13: {"车道序号": 5,"方向":"南北左转","车道方向":"南北左转第二条车道","位置":"南"},  # 计数器编号 22 的数据
        14: {"车道序号": 4,"方向":"南北直行","车道方向":"南北直行第三条车道","位置":"南"},  # 计数器编号 21 的数据
        15: {"车道序号": 3,"方向":"南北直行","车道方向":"南北直行第四条车道","位置":"南"},  # 计数器编号 22 的数据
        16: {"车道序号": 2,"方向":"南北直行","车道方向":"南北直行第五条车道","位置":"南"},  # 计数器编号 21 的数据
    },
    11: {  # 车道编号 11
        6: {"车道序号": 7,"方向":"东西左转","车道方向":"东西左转第一条车道","位置":"东"},  # 计数器编号 22 的数据
        7: {"车道序号": 6,"方向":"东西左转","车道方向":"东西左转第二条车道","位置":"东"},  # 计数器编号 21 的数据
        8: {"车道序号": 5,"方向":"东西直行","车道方向":"东西直行第三条车道","位置":"东"},  # 计数器编号 22 的数据
        9: {"车道序号": 4,"方向":"东西直行","车道方向":"东西直行第四条车道","位置":"东"},  # 计数器编号 21 的数据
        10: {"车道序号": 3,"方向":"东西直行","车道方向":"东西直行第五条车道","位置":"东"},  # 计数器编号 22 的数据
        11: {"车道序号": 2,"方向":"东西直行","车道方向":"东西直行第六条车道","位置":"东"},  # 计数器编号 22 的数据
    },
    12: {  # 车道编号 3
        1: {"车道序号": 6,"方向":"南北左转","车道方向":"南北左转第一条车道","位置":"北"},  # 计数器编号 22 的数据
        2: {"车道序号": 5,"方向":"南北左转","车道方向":"南北左转第二条车道","位置":"北"},  # 计数器编号 21 的数据
        3: {"车道序号": 4,"方向":"南北直行","车道方向":"南北直行第三条车道","位置":"北"},  # 计数器编号 22 的数据
        4: {"车道序号": 3,"方向":"南北直行","车道方向":"南北直行第四条车道","位置":"北"},  # 计数器编号 21 的数据
        5: {"车道序号": 2,"方向":"南北直行","车道方向":"南北直行第五条车道","位置":"北"},  # 计数器编号 22 的数据
    }
}

phase_lane_mapping = {
    5: [
        {"counter_id": 22, "lane_id": 2, "位置": "西", "方向": "东西直行", "车道序号": 3, "车道方向": "东西直行第六条车道"},
        {"counter_id": 23, "lane_id": 2, "位置": "西", "方向": "东西直行", "车道序号": 2, "车道方向": "东西直行第七条车道"},
        {"counter_id": 12, "lane_id": 6, "位置": "南", "方向": "南北左转", "车道序号": 6, "车道方向": "南北左转第一条车道"},
        {"counter_id": 9,  "lane_id": 11, "位置": "东", "方向": "东西直行", "车道序号": 4, "车道方向": "东西直行第四条车道"},
        {"counter_id": 10, "lane_id": 11, "位置": "东", "方向": "东西直行", "车道序号": 3, "车道方向": "东西直行第五条车道"},
        {"counter_id": 11, "lane_id": 11, "位置": "东", "方向": "东西直行", "车道序号": 2, "车道方向": "东西直行第六条车道"}
    ],
    6: [
        {"counter_id": 19, "lane_id": 2, "位置": "西", "方向": "东西左转", "车道序号": 6, "车道方向": "东西左转第三条车道"},
        {"counter_id": 20, "lane_id": 2, "位置": "西", "方向": "东西直行", "车道序号": 5, "车道方向": "东西直行第四条车道"},
        {"counter_id": 21, "lane_id": 2, "位置": "西", "方向": "东西直行", "车道序号": 4, "车道方向": "东西直行第五条车道"},
        {"counter_id": 7,  "lane_id": 11, "位置": "东", "方向": "东西左转", "车道序号": 6, "车道方向": "东西左转第二条车道"},
        {"counter_id": 8,  "lane_id": 11, "位置": "东", "方向": "东西直行", "车道序号": 5, "车道方向": "东西直行第三条车道"}
    ],
    7: [
        {"counter_id": 17, "lane_id": 2, "位置": "西", "方向": "东西左转", "车道序号": 8, "车道方向": "东西左转第一条车道"},
        {"counter_id": 18, "lane_id": 2, "位置": "西", "方向": "东西左转", "车道序号": 7, "车道方向": "东西左转第二条车道"},
        {"counter_id": 16, "lane_id": 6, "位置": "南", "方向": "南北直行", "车道序号": 2, "车道方向": "南北直行第五条车道"},
        {"counter_id": 6,  "lane_id": 11, "位置": "东", "方向": "东西左转", "车道序号": 7, "车道方向": "东西左转第一条车道"},
        {"counter_id": 4,  "lane_id": 12, "位置": "北", "方向": "南北直行", "车道序号": 3, "车道方向": "南北直行第四条车道"},
        {"counter_id": 5,  "lane_id": 12, "位置": "北", "方向": "南北直行", "车道序号": 2, "车道方向": "南北直行第五条车道"}
    ],
    8: [
        {"counter_id": 14, "lane_id": 6, "位置": "南", "方向": "南北直行", "车道序号": 4, "车道方向": "南北直行第三条车道"},
        {"counter_id": 15, "lane_id": 6, "位置": "南", "方向": "南北直行", "车道序号": 3, "车道方向": "南北直行第四条车道"},
        {"counter_id": 2,  "lane_id": 12, "位置": "北", "方向": "南北左转", "车道序号": 5, "车道方向": "南北左转第二条车道"},
        {"counter_id": 3,  "lane_id": 12, "位置": "北", "方向": "南北直行", "车道序号": 4, "车道方向": "南北直行第三条车道"}
    ]
}

# 发车点与相位ID的映射
start_point_to_phase_id = {
    9: 5,  # 西 -> 东西直行相位
    10: 6,  # 东 -> 东西直行相位
    11: 7,  # 北 -> 南北直行相位
    12: 8  # 南 -> 南北左转相位
}
# 发车点-相位ID-对应车道
dispatch_to_phase_mapping = {
    "9": {
        "phase_id": 5,    # 相位 ID
        "lanes": [5, 6, 7, 8,9,10,11,12]  # 对应的车道 ID 列表
    },
    "10": {
        "phase_id": 8,    # 相位 ID
        "lanes": [46, 47,48,49,50,51,52]  # 对应的车道 ID 列表
    },
    "11": {
        "phase_id": 6,    # 相位 ID
        "lanes": [53, 54, 55,56,57,58]  # 对应的车道 ID 列表
    },
    "12": {
        "phase_id": 7,    # 相位 ID
        "lanes": [40, 41, 42, 43,44,45]  # 对应的车道 ID 列表
    }
}



aggregate_time = 300  # 采集器集计周期，也是计算配时周期，与路网中保持一致

capacity = 1400  # 单车道通行能力

max_period_time = 200  # 最大周期时长
min_period_time = 100  # 最小周期时长

# 定义全局参数（这些值可以根据实际情况进行调整）
CRITICAL_THRESHOLD = 10  # 当绿灯剩余时间少于 10 秒时，认为绿灯时间即将结束
THRESHOLD_DISTANCE_TO_SIGNAL = 50  # 当公交车距离信号灯小于 50 米时，开始检测是否需要优先
ADDITIONAL_GREEN_TIME = 10  # 延长绿灯的时间，单位为秒
REDUCTION_TIME = 5  # 缩短红灯的时间，单位为秒
MIN_RED_TIME = 3  # 最短红灯时间，避免红灯过短，单位为秒
